In [2]:
import pandas as pd
import numpy as np

In [4]:
calendario = pd.read_csv("D:\Trabajo 07062019\Personal\España\Master Data Science\TFM\capstone-project-2\capstone-project-r2\data\daily_calendar_with_events.csv")
precios = pd.read_csv("D:\Trabajo 07062019\Personal\España\Master Data Science\TFM\capstone-project-2\capstone-project-r2\data\item_prices.csv")
ventas = pd.read_csv("D:\Trabajo 07062019\Personal\España\Master Data Science\TFM\capstone-project-2\capstone-project-r2\data\item_sales.csv")

<>:1: SyntaxWarning: invalid escape sequence '\T'
<>:2: SyntaxWarning: invalid escape sequence '\T'
<>:3: SyntaxWarning: invalid escape sequence '\T'
<>:1: SyntaxWarning: invalid escape sequence '\T'
<>:2: SyntaxWarning: invalid escape sequence '\T'
<>:3: SyntaxWarning: invalid escape sequence '\T'
D:\Users\roberto.steel\AppData\Local\Temp\ipykernel_17884\4023387716.py:1: SyntaxWarning: invalid escape sequence '\T'
  calendario = pd.read_csv("D:\Trabajo 07062019\Personal\España\Master Data Science\TFM\capstone-project-2\capstone-project-r2\data\daily_calendar_with_events.csv")
D:\Users\roberto.steel\AppData\Local\Temp\ipykernel_17884\4023387716.py:2: SyntaxWarning: invalid escape sequence '\T'
  precios = pd.read_csv("D:\Trabajo 07062019\Personal\España\Master Data Science\TFM\capstone-project-2\capstone-project-r2\data\item_prices.csv")
D:\Users\roberto.steel\AppData\Local\Temp\ipykernel_17884\4023387716.py:3: SyntaxWarning: invalid escape sequence '\T'
  ventas = pd.read_csv("D:\Trabajo 07062019\Personal\España\Master Data Science\TFM\capstone-project-2\capstone-project-r2\data\item_sales.csv")

In [5]:
calendario.head(5)

         date    weekday  weekday_int    d event
0  2011-01-29   Saturday            1  d_1   NaN
1  2011-01-30     Sunday            2  d_2   NaN
2  2011-01-31     Monday            3  d_3   NaN
3  2011-02-01    Tuesday            4  d_4   NaN
4  2011-02-02  Wednesday            5  d_5   NaN

In [6]:
precios.head()

               item    category store_code  yearweek  sell_price
0  ACCESORIES_1_001  ACCESORIES      NYC_1  201328.0     12.7414
1  ACCESORIES_1_001  ACCESORIES      NYC_1  201329.0     12.7414
2  ACCESORIES_1_001  ACCESORIES      NYC_1  201330.0     10.9858
3  ACCESORIES_1_001  ACCESORIES      NYC_1  201331.0     10.9858
4  ACCESORIES_1_001  ACCESORIES      NYC_1  201332.0     10.9858

In [7]:
ventas.head()

,id,item,category,department,store,store_code,region,d_1,d_2,d_3,...,d_1904,d_1905,d_1906,d_1907,d_1908,d_1909,d_1910,d_1911,d_1912,d_1913
0,ACCESORIES_1_001_NYC_1,ACCESORIES_1_001,ACCESORIES,ACCESORIES_1,Greenwich_Village,NYC_1,New York,0,0,0,...,1,3,0,1,1,1,3,0,1,1
1,ACCESORIES_1_002_NYC_1,ACCESORIES_1_002,ACCESORIES,ACCESORIES_1,Greenwich_Village,NYC_1,New York,0,0,0,...,0,0,0,0,0,1,0,0,0,0
2,ACCESORIES_1_003_NYC_1,ACCESORIES_1_003,ACCESORIES,ACCESORIES_1,Greenwich_Village,NYC_1,New York,0,0,0,...,2,1,2,1,1,1,0,1,1,1
3,ACCESORIES_1_004_NYC_1,ACCESORIES_1_004,ACCESORIES,ACCESORIES_1,Greenwich_Village,NYC_1,New York,0,0,0,...,1,0,5,4,1,0,1,3,7,2
4,ACCESORIES_1_005_NYC_1,ACCESORIES_1_005,ACCESORIES,ACCESORIES_1,Greenwich_Village,NYC_1,New York,0,0,0,...,2,1,1,0,1,1,2,2,2,4